In [1809]:
import pandas as pd
import numpy as np

In [1810]:
pd.__version__

'2.3.3'

In [1811]:
obj=pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [1812]:
obj.array

<NumpyExtensionArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [1813]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [1814]:
obj2=pd.Series([4,7,-5,3], index=['a', 'b', 'c', 'd'])
obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [1815]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [1816]:
obj2['c']

np.int64(-5)

In [1817]:
obj2["b"]=45

In [1818]:
obj2

a     4
b    45
c    -5
d     3
dtype: int64

In [1819]:
obj2[["b", "c", "d"]]

b    45
c    -5
d     3
dtype: int64

In [1820]:
np.exp(obj2)

a    5.459815e+01
b    3.493427e+19
c    6.737947e-03
d    2.008554e+01
dtype: float64

In [1821]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
obj3=pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [1822]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [1823]:
states=["California", "Ohio", "Oregon", "Texas"]
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [1824]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [1825]:
obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [1826]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [1827]:
obj4 + obj3

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [1828]:
obj4.name = "population"
obj4.index.name="state"

In [1829]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [1830]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [1831]:
obj.index=["Bob", "Steve", "Jeff", "Ryan"]
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

# Data Frame

In [1832]:
data={"State":["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
      "Year":[2000, 2001, 2002, 2001, 2002, 2003],
      "Pop":[1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame=pd.DataFrame(data)
frame

    State  Year  Pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [1833]:
frame.head()

    State  Year  Pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [1834]:
frame.tail()

    State  Year  Pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [1835]:
pd.DataFrame(data, columns=["Year", "State", "Pop"])

   Year   State  Pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [1836]:
frame2=pd.DataFrame(data, columns=["Year", "State", "Pop", "Debt"])
frame2

   Year   State  Pop Debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [1837]:
frame2.columns

Index(['Year', 'State', 'Pop', 'Debt'], dtype='object')

In [1838]:
frame2.Year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: Year, dtype: int64

In [1839]:
frame2.State

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: State, dtype: object

In [1840]:
frame2.loc[1]

Year     2001
State    Ohio
Pop       1.7
Debt      NaN
Name: 1, dtype: object

In [1841]:
frame2.iloc[2]

Year     2002
State    Ohio
Pop       3.6
Debt      NaN
Name: 2, dtype: object

In [1842]:
frame2["Debt"] = 16.5
frame2

   Year   State  Pop  Debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [1843]:
frame2["eastern"] = frame2["State"] == "Ohio"
frame2

   Year   State  Pop  Debt  eastern
0  2000    Ohio  1.5  16.5     True
1  2001    Ohio  1.7  16.5     True
2  2002    Ohio  3.6  16.5     True
3  2001  Nevada  2.4  16.5    False
4  2002  Nevada  2.9  16.5    False
5  2003  Nevada  3.2  16.5    False

In [1844]:
del frame2["eastern"]
frame2.columns

Index(['Year', 'State', 'Pop', 'Debt'], dtype='object')

In [1845]:
population = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
              "Nevada": {2001: 2.4, 2002: 2.9}}
frame3 = pd.DataFrame(population)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [1846]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [1847]:
pd.DataFrame(population, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [1848]:
pdata = {"Ohio": frame3["Ohio"][:-1],
         "Nevada": frame3["Nevada"][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [1849]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [1850]:
pd.DataFrame([
    {"A": 1, "B": 2},
    {"A": 3, "C": 4}
])

   A    B    C
0  1  2.0  NaN
1  3  NaN  4.0

In [1851]:
frame3.index.name = "year"
frame3.columns.name = "state"
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [1852]:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])
index=obj.index
index[1:]

Index(['b', 'c'], dtype='object')

In [1853]:
# index[1] = "d" # TypeError("Index does not support mutable operations")

In [1854]:
levels=pd.Index(np.arange(3))
levels

Index([0, 1, 2], dtype='int64')

In [1855]:
obj2=pd.Series([1.5, -2.5, 0], index=levels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [1856]:
obj2.index is levels

True

In [1857]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [1858]:
pd.Index(["foo", "foo", "bar", "bar"])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

# Essential Functionality

In [1859]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [1860]:
obj2=obj.reindex(["a", "b", "c", "d", "e"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [1861]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [1862]:
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [1863]:
obj3.reindex(range(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [1864]:
obj3.reindex(range(6), method="nearest")

0      blue
1    purple
2    purple
3    yellow
4    yellow
5    yellow
dtype: object

In [1865]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [1866]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=["a", "c", "d"],
                     columns=["Ohio", "Texas", "California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [1867]:
frame2 = frame.reindex(index=["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [1868]:
states = ["Texas", "Utah", "California"]
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [1869]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [1870]:
frame.loc[["a", "d", "c"], ["California", "Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

In [1871]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [1872]:
new_obj = obj.drop("c")
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [1873]:
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [1874]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [1875]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [1876]:
data.drop(["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [1877]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [1878]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [1879]:
data.drop("three", axis=1)

          one  two  four
Ohio        0    1     3
Colorado    4    5     7
Utah        8    9    11
New York   12   13    15

In [1880]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [1881]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [1882]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=["a", "c", "e", "f", "g"])
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [1883]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

# Arithmetic and Data Alignment

In [1884]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)),columns=list("bcd"), 
                   index=["Ohio", "Texas", "Colorado"])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [1885]:
df2 = pd.DataFrame(np.arange(12.).reshape((4,3)),columns=list("bde"),
                   index=["Utah", "Ohio", "Texas", "Oregon"])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [1886]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [1887]:
df1 = pd.DataFrame({"A": [1, 2]})
df2 = pd.DataFrame({"B": [3, 4]})
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

#### Arithmetic methods with fill values

In [1888]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list("abcd"))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [1889]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),columns=list("abcde"))
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [1890]:
df2.loc[1, "b"]= np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [1891]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [1892]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [1893]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [1894]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [1895]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [1896]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"), 
                     index=["Utah", "Ohio", "Texas", "Oregon"])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [1897]:
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [1898]:
type(series)

pandas.core.series.Series

In [1899]:
type(frame)

pandas.core.frame.DataFrame

In [1900]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [1901]:
series2 = pd.Series(np.arange(3), index=["b", "e", "f"])
series2

d:\sahoreia\Python\DA\.venv\Lib\site-packages\IPython\core\displayhook.py:292: UserWarning: Output cache limit (currently 1000 entries) hit.
Flushing oldest 200 entries.
  warn('Output cache limit (currently {sz} entries) hit.\n'

b    0
e    1
f    2
dtype: int64

In [1902]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [1903]:
series3 = frame["d"]
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [1904]:
frame.sub(series3, axis="index")

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [1905]:
frame.sub(series3, axis="columns")

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

### Function Application and Mapping

In [1906]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    0.817313  0.698500 -0.639708
Ohio   -0.759289 -0.463269  1.487836
Texas   1.973693 -0.560577  1.386632
Oregon  0.286085  0.470175 -0.524720

In [1907]:
np.abs(frame)

               b         d         e
Utah    0.817313  0.698500  0.639708
Ohio    0.759289  0.463269  1.487836
Texas   1.973693  0.560577  1.386632
Oregon  0.286085  0.470175  0.524720

In [1908]:
def f1(x):
    return x.max() - x.min()

In [1909]:
frame.apply(f1)

b    2.732981
d    1.259077
e    2.127544
dtype: float64

In [1910]:
frame.apply(f1, axis="columns")

Utah      1.457021
Ohio      2.247124
Texas     2.534269
Oregon    0.994895
dtype: float64

In [1911]:
def f2(x):
    return pd.Series([x.min(), x.max()], index=["min", "max"])

In [1912]:
frame.apply(f2)

            b         d         e
min -0.759289 -0.560577 -0.639708
max  1.973693  0.698500  1.487836

In [1913]:
frame.apply(f2, axis="columns")

             min       max
Utah   -0.639708  0.817313
Ohio   -0.759289  1.487836
Texas  -0.560577  1.973693
Oregon -0.524720  0.470175

In [1914]:
def my_format(x):
    return f"{x:.2f}"

In [1915]:
frame.applymap(my_format)

C:\Users\sahor\AppData\Local\Temp\ipykernel_11736\1462544007.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  frame.applymap(my_format)

            b      d      e
Utah     0.82   0.70  -0.64
Ohio    -0.76  -0.46   1.49
Texas    1.97  -0.56   1.39
Oregon   0.29   0.47  -0.52

In [1916]:
frame["b"].map(my_format)

Utah       0.82
Ohio      -0.76
Texas      1.97
Oregon     0.29
Name: b, dtype: object

### Sorting and Ranking

In [1917]:
obj = pd.Series(np.arange(4), index=["d", "a", "b", "c"])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [1918]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [1919]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=["three", "one"],
                     columns=["d", "a", "b", "c"])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [1920]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [1921]:
frame.sort_index(axis="columns")

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [1922]:
frame.sort_index(axis="columns", ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [1923]:
obj =pd.Series([4, 7, -3, 2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [1924]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [1925]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [1926]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [1927]:
obj.sort_values(na_position="first")

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [1928]:
frame = pd.DataFrame({"b": [4, 7, -3, 2],
                      "a": [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [1929]:
frame.sort_values("b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [1930]:
frame.sort_values(by=["a", "b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [1931]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [1932]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [1933]:
obj.rank(method="first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [1934]:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1],
                        "c": [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [1935]:
frame.rank(axis="columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [1936]:
frame.rank()

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

#### Axis Indexes with Duplicate Labels

In [1937]:
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [1938]:
obj.index.is_unique

False

In [1939]:
obj["a"]

a    0
a    1
dtype: int64

In [1940]:
obj["c"]

np.int64(4)

In [1941]:
df = pd.DataFrame(np.random.standard_normal((5, 3)),
                    index=["a", "a", "b", "b", "c"])
df

          0         1         2
a -2.164434 -0.519139  0.623009
a -1.419600  0.259146  0.479272
b  0.543141 -1.231359 -0.570382
b -0.457658  0.844016 -2.545468
c  1.193944  0.298895 -0.575508

In [1942]:
df.loc["b"]

          0         1         2
b  0.543141 -1.231359 -0.570382
b -0.457658  0.844016 -2.545468

In [1943]:
df.loc["c"]

0    1.193944
1    0.298895
2   -0.575508
Name: c, dtype: float64

## Summarizing and Computing Descriptive Statistics

In [1944]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                     [np.nan, np.nan], [0.75, -1.3]],
                    index=["a", "b", "c", "d"],
                    columns=["one", "two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [1945]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [1946]:
df.sum(axis="columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [1947]:
df.sum(axis="columns", skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [1948]:
df.sum(axis="index" ,skipna=False)

one   NaN
two   NaN
dtype: float64

In [1949]:
df.mean(axis="columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [1950]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [1951]:
df.idxmax()

one    b
two    d
dtype: object

In [1952]:
df.idxmin()

one    d
two    b
dtype: object

In [1953]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [1954]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [1955]:
obj = pd.Series(["a", "a", "b", "c"] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [1956]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and Covariance

C:\Users\sahor\AppData\Local\Temp\ipykernel_11736\890640361.py:1: FutureWarning: The default fill_method='pad' in DataFrame.pct_change is deprecated and will be removed in a future version. Either fill in any non-leading NA values prior to calling pct_change or specify 'fill_method=None' to not fill NA values.
  df.pct_change()

        one       two
a       NaN       NaN
b  4.071429       NaN
c  0.000000  0.000000
d -0.894366 -0.711111